[
  {
    "question": "A uniform but time varying magnetic field is present in a circular region of radius R. The magnetic field is perpendicular and into the plane of the loop and the magnitude of field is increasing at a constant rate   α.   There is a straight conducting rod of length 2R placed as shown in figure. The magnitude of induced emf across the rod is"
  },
  {
    "question": "In a   L – R   decay circuit, the initial current at   t   = 0 is   I . The total charge that has flown through the resistor till the energy in the inductor has reduced to one–fourth of its initial value, is"
  },
  {
    "question": "A long wire of radius R, carries current uniformly distributed over its cross section. The total current carried by the wire is I. The magnetic energy per unit length inside the wire is"
  },
  {
    "question": "The decreasing order of wavelength of infrared, gamma rays, UV and microwave rays is"
  },
  {
    "question": "Figure shows plane waves refracted from air to water using Huygen's principle (where   a ,   b ,   c ,   d ,   e  are lengths on the diagram). The refractive index of water wrt air is the ratio :-"
  },
  {
    "question": "In Young's double slit experiment, the fringes are displaced by a distance x when a glass plate of refractive index 1.5 is introduced in the path of one of the beams. When this plate is replaced by another plate of the same thickness, the shift of fringes is (3/2)x. The refractive index of the second plate is"
  },
  {
    "question": "A conducting ring of mass 2 kg and radius 0.5 m is placed on a smooth horizontal lane. The ring carries a current i = 4A. A horizontal magnetic field B = 10T is switched on at time t = 0 as shown in figure. The initial angular acceleration of the ring will be"
  },
  {
    "question": "As shown in the figure, a metallic rod of linear density 0.45 kg m –1   is lying horizontally on a smooth incline plane which makes an angle of 45° with the horizontal. The minimum current flowing in the rod required to keep it stationary, when 0.15 T magnetic field is acting on it in the vertical upward direction, will be : [Use g = 10 m/s 2 ]"
  },
  {
    "question": "An ideal efficient transformer has a primary power input of 10 kW . The secondary current when the transformer is on load is 25 A . If the primary : secondary turns ratio is 8 : 1, then the potential difference applied to the primary coil is"
  },
  {
    "question": "When a voltage v s   =   sin ( ω   t + 15º ) is applied to an AC circuit the current in the circuit is  found to be i = 2 sin ( ω t +   π/ 4), then average power consumed in the circuit is (V s   measured in volt, i measured in ampere)"
  }
]